# z = 10x(1) + 15x(2) + 20x(3) -> max
# 1x(1)     + 0x(2)     + 0x(3)     >= 10
# 0x(1)     + 1x(2)     + 0x(3)     >= 20
# 0x(1)     + 0x(2)     + 1x(3)     >= 25
# 1x(1)     + 0x(2)     + 0x(3)     <= 20
# 0x(1)     + 1x(2)     + 0x(3)     <= 40
# 0x(1)     + 0x(2)     + 1x(3)     <= 100
# 10x(1)    + 15x(2)    + 20x(3)    <= 1495
# 30x(1)    + 20x(2)    + 25x(3)    <= 4500
# 2x(1)     + 0x(2)     + 4x(3)     <= 200
# 4x(1)     + 3x(2)     + 1x(3)     <= 500

library(Rglpk)
library(lpSolve)

obj <- c(10, 15, 20)
mat <- matrix(c(1, 0, 0, 1, 0, 0, 10, 30, 2, 4,
                0, 1, 0, 0, 1, 0, 15, 20, 0, 3,
                0, 0, 1, 0, 0, 1, 20, 25, 4 ,1
                ), nrow=10)

dir <- c(">=", ">=", ">=", "<=", "<=", "<=", "<=", "<=", "<=", "<=")
rhs <- c(10, 20, 25, 20, 40, 100, 1495, 4500, 200, 500)
types <- rep("I", 3)
max <- TRUE

result <- Rglpk_solve_LP(obj, mat, dir, rhs, max = max)

print("Значение целевой функции")
print(result$optimum)

print("Решение:")
print(result$solution)